# 2. Create DB and Insert Data

DB를 생성하고 테이블을 만들어 MovieLens 데이터셋 Insert 하기

> Create DB

In [1]:
import pandas as pd
import pymysql

In [46]:
conn = pymysql.connect(host='127.0.0.1'
                , port=3306
                , user = 'root'
                , password='root1234'
                , charset='utf8'
                )

In [ ]:
cursor = conn.cursor()
cursor.execute("CREATE DATABASE movie_pj")

In [48]:
conn.commit()
conn.close()

---

> Create Table

In [130]:
conn = pymysql.connect(host='127.0.0.1'
                , port=3306
                , user = 'root'
                , password='root1234'
                , db = 'movie_pj'
                , charset='utf8'
                )

In [131]:
create_table_users = """
    create table users (
	user_id int not null primary key,
	age int,
    sex VARCHAR(10),
    occupation VARCHAR(100)
);
"""

In [132]:
create_table_movies= """
    create table movies (
	movie_id int not null primary key,
	title VARCHAR(100),
    release_date VARCHAR(50),
    imdb_url VARCHAR(300),
    all_genres VARCHAR(100)
);
"""

In [133]:
create_table_ratings= """
    create table ratings (
    rating_id int AUTO_INCREMENT primary key not null,
    user_id int not null,
	movie_id int not null,
	rating int,
    FOREIGN KEY (user_id) REFERENCES users (user_id),
    FOREIGN KEY (movie_id) REFERENCES movies (movie_id)
);
"""

# foreign key 참조를 위해 primary key(rating_id)를 새로 생성

In [134]:
cursor = conn.cursor()

In [135]:
cursor.execute(create_table_users)
cursor.execute(create_table_movies)
cursor.execute(create_table_ratings)

0

> Insert Data

In [136]:
users = pd.read_csv('data/users.csv')
users.head(2)

   user_id  age sex  occupation
0        0   24   M  technician
1        1   53   F       other

In [137]:
# insert users table
for i in range(len(users)):
    cursor.execute(f"INSERT INTO users (user_id, age, sex, occupation) VALUES \
                ({users['user_id'][i]}, {users['age'][i]}, '{users['sex'][i]}', '{users['occupation'][i]}');")

In [138]:
movies = pd.read_csv('data/movies.csv')
movies.head(2)

,movie_id,title,release_date,imdb_url,all_genres
0,0,Toy Story (1995),01-Jan-1995,http://us.imdb.com/M/title-exact?Toy%20Story%2...,Animation-Children-Comedy
1,1,GoldenEye (1995),01-Jan-1995,http://us.imdb.com/M/title-exact?GoldenEye%20(...,Action-Adventure-Thriller

In [139]:
# insert movies table
for i in range(len(movies)):
    cursor.execute(f'INSERT INTO movies (movie_id, title, release_date, imdb_url, all_genres) VALUES \
                ({movies["movie_id"][i]}, "{movies["title"][i]}", "{movies["release_date"][i]}", "{movies["imdb_url"][i]}", "{movies["all_genres"][i]}");')

In [140]:
ratings = pd.read_csv('data/ratings.csv')
ratings.head(2)

   user_id  movie_id  rating
0      195       241     3.0
1      185       301     3.0

In [141]:
# insert ratings table
for i in range(len(ratings)):
    cursor.execute(f"INSERT INTO ratings (user_id, movie_id, rating) VALUES \
                ({ratings['user_id'][i]}, {ratings['movie_id'][i]}, {ratings['rating'][i]});")

In [142]:
conn.commit()
conn.close()